## 2.1.1.ведение в SQL, CREATE, INSERT, SELECT.

**SQL (Structured Query Language)** — это язык программирования, используемый для работы с реляционными базами данных.

```CREATE TABLE``` — создает новую таблицу.

```INSERT INTO``` — вставляет данные в таблицу.

```SELECT``` — выбирает данные из таблицы.

```CREATE TABLE students (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```name VARCHAR(50) NOT NULL,```  
    ```age INT,```  
    ```course VARCHAR(50)```  
```);```  

Создание таблицы:
- id — уникальный идентификатор студента (первичный ключ).
- name — имя студента (не может быть пустым).
- age — возраст студента.
- course — курс, на котором учится студент.

Вставка данных  
```INSERT INTO students (name, age, course)```  
```VALUES ('Иван', 20, 'Python'),```  
       ```('Петр', 22, 'JavaScript'),```  
       ```('Мария', 21, 'Python');```

Выборка данных  
```SELECT column1, column2, ...```  
```FROM table_name```  
```WHERE condition;```

#### Пратика

Создание таблицы и вставка данных
```CREATE TABLE employees (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```name VARCHAR(50) NOT NULL,```  
    ```position VARCHAR(50),```  
    ```salary INT```  
```);```  

```INSERT INTO employees (name, position, salary)```  
```VALUES ('Иван Иванов', 'Разработчик', 100000),```  
       ```('Петр Петров', 'Менеджер', 120000),```  
       ```('Мария Сидорова', 'Дизайнер', 90000);```

Выборка данных  
```SELECT * FROM employees```  ```WHERE salary > 95000```  ;

Выборка определенных колонок  
```SELECT name, position FROM employees;```

## 2.1.2.WHERE, ORDER BY, LIMIT.

```WHERE``` — фильтрация данных по условию.

```ORDER BY``` — сортировка данных.

```LIMIT``` — ограничение количества возвращаемых строк.

Примеры использования WHERE  
```SELECT * FROM students```  
```WHERE course = 'Python';```  

```SELECT * FROM students```  
```WHERE age > 20;```  

```SELECT * FROM students```  
```WHERE course = 'Python' AND age > 20;```  

```SELECT * FROM students```  
```WHERE course = 'Python' OR course = 'JavaScript';```

Сортировка данных (ORDER BY)
```SELECT * FROM students```  
```ORDER BY age ASC;```  

```SELECT * FROM students```  
```ORDER BY age DESC;```  

```SELECT * FROM students```  
```ORDER BY course ASC, age DESC;```

Ограничение выборки (LIMIT)
```SELECT * FROM students```  
```LIMIT 2;```  

```SELECT * FROM students```  
```LIMIT 2 OFFSET 2;```

#### Практика

Фильтрация данных  
```SELECT * FROM employees```  
```WHERE salary > 100000;```

Сортировка данных  
```SELECT * FROM books```  
```ORDER BY year DESC;```

Ограничение выборки
```SELECT * FROM books```  
```LIMIT 3;```

## 2.1.3.JOIN (INNER, LEFT, RIGHT).

```INNER JOIN``` — возвращает только те строки, которые имеют совпадения в обеих таблицах.

```LEFT JOIN``` — возвращает все строки из левой таблицы и соответствующие строки из правой таблицы. Если совпадений нет, то в правой таблице будут NULL.

```RIGHT JOIN``` — возвращает все строки из правой таблицы и соответствующие строки из левой таблицы. Если совпадений нет, то в левой таблице будут NULL.

создадим две таблицы: students и courses
--students  
```CREATE TABLE students (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```name VARCHAR(50) NOT NULL,```  
    ```course_id INT```  
```);```  

```INSERT INTO students (name, course_id)```  
```VALUES ('Иван', 1),```  
       ```('Петр', 2),```  
       ```('Мария', 1),```  
       ```('Алексей', NULL);```  

--courses  
```CREATE TABLE courses (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```title VARCHAR(50) NOT NULL```  
```);```  

```INSERT INTO courses (title)```  
```VALUES ('Python'),```  
       ```('JavaScript');```

INNER JOIN  
```SELECT columns```  
```FROM table1```  
```INNER JOIN table2```  
```ON table1.column = table2.column;```  

Пример использования  
```SELECT students.name, courses.title```  
```FROM students```  
```INNER JOIN courses```  
```ON students.course_id = courses.id;```

LEFT JOIN  
```SELECT columns```  
```FROM table1```  
```LEFT JOIN table2```  
```ON table1.column = table2.column;```  

Пример использования  
```SELECT students.name, courses.title```  
```FROM students```  
```LEFT JOIN courses```  
```ON students.course_id = courses.id;```

RIGHT JOIN  
```SELECT columns```  
```FROM table1```  
```RIGHT JOIN table2```  
```ON table1.column = table2.column;```  

Пример использования  
```SELECT students.name, courses.title```  
```FROM students```  
```RIGHT JOIN courses```  
```ON students.course_id = courses.id;```

#### Практика

```CREATE TABLE departments (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```name VARCHAR(50) NOT NULL```  
```);```  

```INSERT INTO departments (name)```  
```VALUES ('IT'),```  
       ```('HR');```  

```CREATE TABLE employees (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```name VARCHAR(50) NOT NULL,```  
    ```department_id INT```  
```);```  

```INSERT INTO employees (name, department_id)```  
```VALUES ('Иван Иванов', 1),```  
       ```('Петр Петров', 2),```  
       ```('Мария Сидорова', 1),```  
       ```('Алексей Алексеев', NULL);```

- INNER JOIN  
```SELECT employees.name, departments.name AS department```  
```FROM employees```  
```INNER JOIN departments```  
```ON employees.department_id = departments.id;```

- LEFT JOIN  
```SELECT employees.name, departments.name AS department```  ```
FROM employee```  s```
LEFT JOIN departmen```  t```s
ON employees.department_id = departments.```  id;

- RIGHT JOIN  
```SELECT employees.name, departments.name AS department```  
```FROM employees```  
```RIGHT JOIN departments```  
```ON employees.department_id = departments.id;```

## 2.1.4.GROUP BY, HAVING, агрегатные функции.

```COUNT()``` — подсчитывает количество строк.

```SUM()``` — вычисляет сумму значений.

```AVG()``` — вычисляет среднее значение.

```MIN()``` — находит минимальное значение.

```MAX()``` — находит максимальное значение.

--Подсчитаем количество студентов в таблице students  
```SELECT COUNT(*) AS total_students```  
```FROM students;```  

--Найдем средний возраст студентов  
```SELECT AVG(age) AS average_age```  
```FROM students;```  

--Найдем максимальную зарплату в таблице employees  
```SELECT MAX(salary) AS max_salary```  
```FROM employees;```  

--Пример использования GROUP BY  
```SELECT course, COUNT(*) AS student_count```  
```FROM students```  
```GROUP BY course;```  

--Найдем среднюю зарплату по отделам в таблице employees  
```SELECT department, AVG(salary) AS average_salary```  
```FROM employees```  
```GROUP BY department;```  

--Найдем курсы, на которых учится более одного студента.  
```SELECT course, COUNT(*) AS student_count```  
```FROM students```  
```GROUP BY course```  
```HAVING student_count > 1;```  

--Найдем отделы, где средняя зарплата больше 100000  
```SELECT department, AVG(salary) AS average_salary```  
```FROM employees```  
```GROUP BY department```  
```HAVING average_salary > 100000;```

#### Практика

-- Создание таблицы  
```CREATE TABLE customers (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```name VARCHAR(50) NOT NULL```  
```);```  

```CREATE TABLE orders (```  
    ```id INT PRIMARY KEY AUTO_INCREMENT,```  
    ```customer_id INT,```  
    ```amount DECIMAL(10, 2)```  
```);```  

```INSERT INTO customers (name)```  
```VALUES ('Иван Иванов'),```  
       ```('Петр Петров'),```  
       ```('Мария Сидорова');```  

```INSERT INTO orders (customer_id, amount)```  
```VALUES (1, 1000.00),```  
       ```(1, 1500.00),```  
       ```(2, 2000.00),```  
       ```(3, 500.00);```

-- Подсчитайте количество заказов для каждого клиента.  
```SELECT customers.name, COUNT(orders.id) AS order_count```  
```FROM customers```  
```LEFT JOIN orders```  
```ON customers.id = orders.customer_id```  
```GROUP BY customers.name;```

-- Найдите общую сумму заказов для каждого клиента.  
```SELECT customers.name, SUM(orders.amount) AS total_amount```  
```FROM customers```  
```LEFT JOIN orders```  
```ON customers.id = orders.customer_id```  
```GROUP BY customers.name;```

-- Найдите клиентов, у которых общая сумма заказов превышает 1000  
```SELECT customers.name, SUM(orders.amount) AS total_amount```  
```FROM customers```  
```LEFT JOIN orders```  
```ON customers.id = orders.customer_id```  
```GROUP BY customers.name```  
```HAVING total_amount > 1000;```